analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/gcr_regs.h
#define MXC_F_GCR_PM_IPO_PD_POS                        16 /**< PM_IPO_PD Position */
#define MXC_F_GCR_PM_IPO_PD                            ((uint32_t)(0x1UL << MXC_F_GCR_PM_IPO_PD_POS)) /**< PM_IPO_PD Mask */

#define MXC_F_GCR_PM_IBRO_PD_POS                       17 /**< PM_IBRO_PD Position */
#define MXC_F_GCR_PM_IBRO_PD                           ((uint32_t)(0x1UL << MXC_F_GCR_PM_IBRO_PD_POS)) /**< PM_IBRO_PD Mask */

#define MXC_F_GCR_PM_NFC_PD_POS                        18 /**< PM_NFC_PD Position */
#define MXC_F_GCR_PM_NFC_PD                            ((uint32_t)(0x1UL << MXC_F_GCR_PM_NFC_PD_POS)) /**< PM_NFC_PD Mask */

#define MXC_F_GCR_PM_ERFO_BP_POS                       20 /**< PM_ERFO_BP Position */
#define MXC_F_GCR_PM_ERFO_BP                           ((uint32_t)(0x1UL << MXC_F_GCR_PM_ERFO_BP_POS)) /**< PM_ERFO_BP Mask */

/**@} end of group GCR_PM_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_PCLKDIV GCR_PCLKDIV
 * @brief    Peripheral Clock Divider.
 * @{
 */
#define MXC_F_GCR_PCLKDIV_SKBDFRQ_POS                  0 /**< PCLKDIV_SKBDFRQ Position */
#define MXC_F_GCR_PCLKDIV_SKBDFRQ                      ((uint32_t)(0x7UL << MXC_F_GCR_PCLKDIV_SKBDFRQ_POS)) /**< PCLKDIV_SKBDFRQ Mask */
#define MXC_V_GCR_PCLKDIV_SKBDFRQ_96MHZ                ((uint32_t)0x2UL) /**< PCLKDIV_SKBDFRQ_96MHZ Value */
#define MXC_S_GCR_PCLKDIV_SKBDFRQ_96MHZ                (MXC_V_GCR_PCLKDIV_SKBDFRQ_96MHZ << MXC_F_GCR_PCLKDIV_SKBDFRQ_POS) /**< PCLKDIV_SKBDFRQ_96MHZ Setting */
#define MXC_V_GCR_PCLKDIV_SKBDFRQ_48MHZ                ((uint32_t)0x3UL) /**< PCLKDIV_SKBDFRQ_48MHZ Value */
#define MXC_S_GCR_PCLKDIV_SKBDFRQ_48MHZ                (MXC_V_GCR_PCLKDIV_SKBDFRQ_48MHZ << MXC_F_GCR_PCLKDIV_SKBDFRQ_POS) /**< PCLKDIV_SKBDFRQ_48MHZ Setting */
#define MXC_V_GCR_PCLKDIV_SKBDFRQ_24MHZ                ((uint32_t)0x4UL) /**< PCLKDIV_SKBDFRQ_24MHZ Value */
#define MXC_S_GCR_PCLKDIV_SKBDFRQ_24MHZ                (MXC_V_GCR_PCLKDIV_SKBDFRQ_24MHZ << MXC_F_GCR_PCLKDIV_SKBDFRQ_POS) /**< PCLKDIV_SKBDFRQ_24MHZ Setting */
#define MXC_V_GCR_PCLKDIV_SKBDFRQ_12MHZ                ((uint32_t)0x5UL) /**< PCLKDIV_SKBDFRQ_12MHZ Value */
#define MXC_S_GCR_PCLKDIV_SKBDFRQ_12MHZ                (MXC_V_GCR_PCLKDIV_SKBDFRQ_12MHZ << MXC_F_GCR_PCLKDIV_SKBDFRQ_POS) /**< PCLKDIV_SKBDFRQ_12MHZ Setting */
#define MXC_V_GCR_PCLKDIV_SKBDFRQ_6MHZ                 ((uint32_t)0x6UL) /**< PCLKDIV_SKBDFRQ_6MHZ Value */
#define MXC_S_GCR_PCLKDIV_SKBDFRQ_6MHZ                 (MXC_V_GCR_PCLKDIV_SKBDFRQ_6MHZ << MXC_F_GCR_PCLKDIV_SKBDFRQ_POS) /**< PCLKDIV_SKBDFRQ_6MHZ Setting */
#define MXC_V_GCR_PCLKDIV_SKBDFRQ_3MHZ                 ((uint32_t)0x7UL) /**< PCLKDIV_SKBDFRQ_3MHZ Value */
#define MXC_S_GCR_PCLKDIV_SKBDFRQ_3MHZ                 (MXC_V_GCR_PCLKDIV_SKBDFRQ_3MHZ << MXC_F_GCR_PCLKDIV_SKBDFRQ_POS) /**< PCLKDIV_SKBDFRQ_3MHZ Setting */

#define MXC_F_GCR_PCLKDIV_SDHCFRQ_POS                  7 /**< PCLKDIV_SDHCFRQ Position */
#define MXC_F_GCR_PCLKDIV_SDHCFRQ                      ((uint32_t)(0x3UL << MXC_F_GCR_PCLKDIV_SDHCFRQ_POS)) /**< PCLKDIV_SDHCFRQ Mask */
#define MXC_V_GCR_PCLKDIV_SDHCFRQ_DIV2                 ((uint32_t)0x0UL) /**< PCLKDIV_SDHCFRQ_DIV2 Value */
#define MXC_S_GCR_PCLKDIV_SDHCFRQ_DIV2                 (MXC_V_GCR_PCLKDIV_SDHCFRQ_DIV2 << MXC_F_GCR_PCLKDIV_SDHCFRQ_POS) /**< PCLKDIV_SDHCFRQ_DIV2 Setting */
#define MXC_V_GCR_PCLKDIV_SDHCFRQ_DIV4                 ((uint32_t)0x1UL) /**< PCLKDIV_SDHCFRQ_DIV4 Value */
#define MXC_S_GCR_PCLKDIV_SDHCFRQ_DIV4                 (MXC_V_GCR_PCLKDIV_SDHCFRQ_DIV4 << MXC_F_GCR_PCLKDIV_SDHCFRQ_POS) /**< PCLKDIV_SDHCFRQ_DIV4 Setting */

#define MXC_F_GCR_PCLKDIV_ADCFRQ_POS                   10 /**< PCLKDIV_ADCFRQ Position */
#define MXC_F_GCR_PCLKDIV_ADCFRQ                       ((uint32_t)(0xFUL << MXC_F_GCR_PCLKDIV_ADCFRQ_POS)) /**< PCLKDIV_ADCFRQ Mask */

#define MXC_F_GCR_PCLKDIV_AONCLKDIV_POS                14 /**< PCLKDIV_AONCLKDIV Position */
#define MXC_F_GCR_PCLKDIV_AONCLKDIV                    ((uint32_t)(0x3UL << MXC_F_GCR_PCLKDIV_AONCLKDIV_POS)) /**< PCLKDIV_AONCLKDIV Mask */
#define MXC_V_GCR_PCLKDIV_AONCLKDIV_DIV4               ((uint32_t)0x0UL) /**< PCLKDIV_AONCLKDIV_DIV4 Value */
#define MXC_S_GCR_PCLKDIV_AONCLKDIV_DIV4               (MXC_V_GCR_PCLKDIV_AONCLKDIV_DIV4 << MXC_F_GCR_PCLKDIV_AONCLKDIV_POS) /**< PCLKDIV_AONCLKDIV_DIV4 Setting */
#define MXC_V_GCR_PCLKDIV_AONCLKDIV_DIV8               ((uint32_t)0x1UL) /**< PCLKDIV_AONCLKDIV_DIV8 Value */
#define MXC_S_GCR_PCLKDIV_AONCLKDIV_DIV8               (MXC_V_GCR_PCLKDIV_AONCLKDIV_DIV8 << MXC_F_GCR_PCLKDIV_AONCLKDIV_POS) /**< PCLKDIV_AONCLKDIV_DIV8 Setting */
#define MXC_V_GCR_PCLKDIV_AONCLKDIV_DIV16              ((uint32_t)0x2UL) /**< PCLKDIV_AONCLKDIV_DIV16 Value */
#define MXC_S_GCR_PCLKDIV_AONCLKDIV_DIV16              (MXC_V_GCR_PCLKDIV_AONCLKDIV_DIV16 << MXC_F_GCR_PCLKDIV_AONCLKDIV_POS) /**< PCLKDIV_AONCLKDIV_DIV16 Setting */
#define MXC_V_GCR_PCLKDIV_AONCLKDIV_DIV32              ((uint32_t)0x3UL) /**< PCLKDIV_AONCLKDIV_DIV32 Value */
#define MXC_S_GCR_PCLKDIV_AONCLKDIV_DIV32              (MXC_V_GCR_PCLKDIV_AONCLKDIV_DIV32 << MXC_F_GCR_PCLKDIV_AONCLKDIV_POS) /**< PCLKDIV_AONCLKDIV_DIV32 Setting */

/**@} end of group GCR_PCLKDIV_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_PCLKDIS0 GCR_PCLKDIS0
 * @brief    Peripheral Clock Disable.
 * @{
 */
#define MXC_F_GCR_PCLKDIS0_GPIO0_POS                   0 /**< PCLKDIS0_GPIO0 Position */
#define MXC_F_GCR_PCLKDIS0_GPIO0                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLKDIS0_GPIO0_POS)) /**< PCLKDIS0_GPIO0 Mask */

#define MXC_F_GCR_PCLKDIS0_GPIO1_POS                   1 /**< PCLKDIS0_GPIO1 Position */
#define MXC_F_GCR_PCLKDIS0_GPIO1                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLKDIS0_GPIO1_POS)) /**< PCLKDIS0_GPIO1 Mask */

#define MXC_F_GCR_PCLKDIS0_GPIO2_POS                   2 /**< PCLKDIS0_GPIO2 Position */
#define MXC_F_GCR_PCLKDIS0_GPIO2                       ((uint32_t)(0x1UL << MXC_F_GCR_PCLKDIS0_GPIO2_POS)) /**< PCLKDIS0_GPIO2 Mask */

#define MXC_F_GCR_PCLKDIS0_USB_POS                     3 /**< PCLKDIS0_USB Position */
#define MXC_F_GCR_PCLKDIS0_USB                         ((uint32_t)(0x1UL << MXC_F_GCR_PCLKDIS0_USB_POS)) /**< PCLKDIS0_USB Mask */

#define MXC_F_GCR_PCLKDIS0_TFT_POS                     4 /**< PCLKDIS0_TFT Position */
#define MXC_F_GCR_PCLKDIS0_TFT                         ((uint32_t)(0x1UL << MXC_F_GCR_PCLKDIS0_TFT_POS)) /**< PCLKDIS0_TFT Mask */

#define MXC_F_GCR_PCLKDIS0_DMA_POS                     5 /**< PCLKDIS0_DMA Position */
#define MXC_F_GCR_PCLKDIS0_DMA                         ((uint32_t)(0x1UL << MXC_F_GCR_PCLKDIS0_DMA_POS)) /**< PCLKDIS0_DMA Mask */

