analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/gcr_regs.h
#define MXC_F_GCR_ECCERR_RAM3_POS                      3 /**< ECCERR_RAM3 Position */
#define MXC_F_GCR_ECCERR_RAM3                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_RAM3_POS)) /**< ECCERR_RAM3 Mask */

#define MXC_F_GCR_ECCERR_RAM4_POS                      4 /**< ECCERR_RAM4 Position */
#define MXC_F_GCR_ECCERR_RAM4                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_RAM4_POS)) /**< ECCERR_RAM4 Mask */

#define MXC_F_GCR_ECCERR_RAM5_POS                      5 /**< ECCERR_RAM5 Position */
#define MXC_F_GCR_ECCERR_RAM5                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_RAM5_POS)) /**< ECCERR_RAM5 Mask */

#define MXC_F_GCR_ECCERR_ICC_POS                       8 /**< ECCERR_ICC Position */
#define MXC_F_GCR_ECCERR_ICC                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_ICC_POS)) /**< ECCERR_ICC Mask */

#define MXC_F_GCR_ECCERR_ICCXIP_POS                    10 /**< ECCERR_ICCXIP Position */
#define MXC_F_GCR_ECCERR_ICCXIP                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_ICCXIP_POS)) /**< ECCERR_ICCXIP Mask */

#define MXC_F_GCR_ECCERR_FLASH0_POS                    11 /**< ECCERR_FLASH0 Position */
#define MXC_F_GCR_ECCERR_FLASH0                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_FLASH0_POS)) /**< ECCERR_FLASH0 Mask */

#define MXC_F_GCR_ECCERR_FLASH1_POS                    12 /**< ECCERR_FLASH1 Position */
#define MXC_F_GCR_ECCERR_FLASH1                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_FLASH1_POS)) /**< ECCERR_FLASH1 Mask */

/**@} end of group GCR_ECCERR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCCED GCR_ECCCED
 * @brief    ECC Not Double Error Detect Register
 * @{
 */
#define MXC_F_GCR_ECCCED_RAM0_POS                      0 /**< ECCCED_RAM0 Position */
#define MXC_F_GCR_ECCCED_RAM0                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM0_POS)) /**< ECCCED_RAM0 Mask */

#define MXC_F_GCR_ECCCED_RAM1_POS                      1 /**< ECCCED_RAM1 Position */
#define MXC_F_GCR_ECCCED_RAM1                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM1_POS)) /**< ECCCED_RAM1 Mask */

#define MXC_F_GCR_ECCCED_RAM2_POS                      2 /**< ECCCED_RAM2 Position */
#define MXC_F_GCR_ECCCED_RAM2                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM2_POS)) /**< ECCCED_RAM2 Mask */

#define MXC_F_GCR_ECCCED_RAM3_POS                      3 /**< ECCCED_RAM3 Position */
#define MXC_F_GCR_ECCCED_RAM3                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM3_POS)) /**< ECCCED_RAM3 Mask */

#define MXC_F_GCR_ECCCED_RAM4_POS                      4 /**< ECCCED_RAM4 Position */
#define MXC_F_GCR_ECCCED_RAM4                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM4_POS)) /**< ECCCED_RAM4 Mask */

#define MXC_F_GCR_ECCCED_RAM5_POS                      5 /**< ECCCED_RAM5 Position */
#define MXC_F_GCR_ECCCED_RAM5                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM5_POS)) /**< ECCCED_RAM5 Mask */

#define MXC_F_GCR_ECCCED_ICC_POS                       8 /**< ECCCED_ICC Position */
#define MXC_F_GCR_ECCCED_ICC                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_ICC_POS)) /**< ECCCED_ICC Mask */

#define MXC_F_GCR_ECCCED_ICCXIP_POS                    10 /**< ECCCED_ICCXIP Position */
#define MXC_F_GCR_ECCCED_ICCXIP                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_ICCXIP_POS)) /**< ECCCED_ICCXIP Mask */

#define MXC_F_GCR_ECCCED_FLASH0_POS                    11 /**< ECCCED_FLASH0 Position */
#define MXC_F_GCR_ECCCED_FLASH0                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_FLASH0_POS)) /**< ECCCED_FLASH0 Mask */

#define MXC_F_GCR_ECCCED_FLASH1_POS                    12 /**< ECCCED_FLASH1 Position */
#define MXC_F_GCR_ECCCED_FLASH1                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_FLASH1_POS)) /**< ECCCED_FLASH1 Mask */

/**@} end of group GCR_ECCCED_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCINTEN GCR_ECCINTEN
 * @brief    ECC Interrupt Enable Register
 * @{
 */
#define MXC_F_GCR_ECCINTEN_RAM0_POS                    0 /**< ECCINTEN_RAM0 Position */
#define MXC_F_GCR_ECCINTEN_RAM0                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_RAM0_POS)) /**< ECCINTEN_RAM0 Mask */

#define MXC_F_GCR_ECCINTEN_RAM1_POS                    1 /**< ECCINTEN_RAM1 Position */
#define MXC_F_GCR_ECCINTEN_RAM1                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_RAM1_POS)) /**< ECCINTEN_RAM1 Mask */

#define MXC_F_GCR_ECCINTEN_RAM2_POS                    2 /**< ECCINTEN_RAM2 Position */
#define MXC_F_GCR_ECCINTEN_RAM2                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_RAM2_POS)) /**< ECCINTEN_RAM2 Mask */

#define MXC_F_GCR_ECCINTEN_RAM3_POS                    3 /**< ECCINTEN_RAM3 Position */
#define MXC_F_GCR_ECCINTEN_RAM3                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_RAM3_POS)) /**< ECCINTEN_RAM3 Mask */

#define MXC_F_GCR_ECCINTEN_RAM4_POS                    4 /**< ECCINTEN_RAM4 Position */
#define MXC_F_GCR_ECCINTEN_RAM4                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_RAM4_POS)) /**< ECCINTEN_RAM4 Mask */

#define MXC_F_GCR_ECCINTEN_RAM5_POS                    5 /**< ECCINTEN_RAM5 Position */
#define MXC_F_GCR_ECCINTEN_RAM5                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_RAM5_POS)) /**< ECCINTEN_RAM5 Mask */

#define MXC_F_GCR_ECCINTEN_ICC_POS                     8 /**< ECCINTEN_ICC Position */
#define MXC_F_GCR_ECCINTEN_ICC                         ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_ICC_POS)) /**< ECCINTEN_ICC Mask */

#define MXC_F_GCR_ECCINTEN_ICCXIP_POS                  10 /**< ECCINTEN_ICCXIP Position */
#define MXC_F_GCR_ECCINTEN_ICCXIP                      ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_ICCXIP_POS)) /**< ECCINTEN_ICCXIP Mask */

#define MXC_F_GCR_ECCINTEN_FLASH0_POS                  11 /**< ECCINTEN_FLASH0 Position */
#define MXC_F_GCR_ECCINTEN_FLASH0                      ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_FLASH0_POS)) /**< ECCINTEN_FLASH0 Mask */

