analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/gcr_regs.h
#define MXC_F_GCR_ECCINTEN_FLASH1_POS                  12 /**< ECCINTEN_FLASH1 Position */
#define MXC_F_GCR_ECCINTEN_FLASH1                      ((uint32_t)(0x1UL << MXC_F_GCR_ECCINTEN_FLASH1_POS)) /**< ECCINTEN_FLASH1 Mask */

/**@} end of group GCR_ECCINTEN_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCADDR GCR_ECCADDR
 * @brief    ECC Error Address Register
 * @{
 */
#define MXC_F_GCR_ECCADDR_DADDR_POS                    0 /**< ECCADDR_DADDR Position */
#define MXC_F_GCR_ECCADDR_DADDR                        ((uint32_t)(0x3FFFUL << MXC_F_GCR_ECCADDR_DADDR_POS)) /**< ECCADDR_DADDR Mask */

#define MXC_F_GCR_ECCADDR_DB_POS                       14 /**< ECCADDR_DB Position */
#define MXC_F_GCR_ECCADDR_DB                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_DB_POS)) /**< ECCADDR_DB Mask */

#define MXC_F_GCR_ECCADDR_DE_POS                       15 /**< ECCADDR_DE Position */
#define MXC_F_GCR_ECCADDR_DE                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_DE_POS)) /**< ECCADDR_DE Mask */

#define MXC_F_GCR_ECCADDR_TADDR_POS                    16 /**< ECCADDR_TADDR Position */
#define MXC_F_GCR_ECCADDR_TADDR                        ((uint32_t)(0x3FFFUL << MXC_F_GCR_ECCADDR_TADDR_POS)) /**< ECCADDR_TADDR Mask */

#define MXC_F_GCR_ECCADDR_TB_POS                       30 /**< ECCADDR_TB Position */
#define MXC_F_GCR_ECCADDR_TB                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_TB_POS)) /**< ECCADDR_TB Mask */

#define MXC_F_GCR_ECCADDR_TE_POS                       31 /**< ECCADDR_TE Position */
#define MXC_F_GCR_ECCADDR_TE                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_TE_POS)) /**< ECCADDR_TE Mask */

/**@} end of group GCR_ECCADDR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_NFCLDOCTRL GCR_NFCLDOCTRL
 * @brief    NFC LDO Control Register
 * @{
 */
#define MXC_F_GCR_NFCLDOCTRL_EN_POS                    4 /**< NFCLDOCTRL_EN Position */
#define MXC_F_GCR_NFCLDOCTRL_EN                        ((uint32_t)(0x1UL << MXC_F_GCR_NFCLDOCTRL_EN_POS)) /**< NFCLDOCTRL_EN Mask */

#define MXC_F_GCR_NFCLDOCTRL_PD_EN_POS                 5 /**< NFCLDOCTRL_PD_EN Position */
#define MXC_F_GCR_NFCLDOCTRL_PD_EN                     ((uint32_t)(0x1UL << MXC_F_GCR_NFCLDOCTRL_PD_EN_POS)) /**< NFCLDOCTRL_PD_EN Mask */

#define MXC_F_GCR_NFCLDOCTRL_VSEL_POS                  6 /**< NFCLDOCTRL_VSEL Position */
#define MXC_F_GCR_NFCLDOCTRL_VSEL                      ((uint32_t)(0x3UL << MXC_F_GCR_NFCLDOCTRL_VSEL_POS)) /**< NFCLDOCTRL_VSEL Mask */

#define MXC_F_GCR_NFCLDOCTRL_BP_EN_POS                 8 /**< NFCLDOCTRL_BP_EN Position */
#define MXC_F_GCR_NFCLDOCTRL_BP_EN                     ((uint32_t)(0x1UL << MXC_F_GCR_NFCLDOCTRL_BP_EN_POS)) /**< NFCLDOCTRL_BP_EN Mask */

#define MXC_F_GCR_NFCLDOCTRL_DISCH_POS                 9 /**< NFCLDOCTRL_DISCH Position */
#define MXC_F_GCR_NFCLDOCTRL_DISCH                     ((uint32_t)(0x1UL << MXC_F_GCR_NFCLDOCTRL_DISCH_POS)) /**< NFCLDOCTRL_DISCH Mask */

#define MXC_F_GCR_NFCLDOCTRL_EN_DLY_POS                13 /**< NFCLDOCTRL_EN_DLY Position */
#define MXC_F_GCR_NFCLDOCTRL_EN_DLY                    ((uint32_t)(0x1UL << MXC_F_GCR_NFCLDOCTRL_EN_DLY_POS)) /**< NFCLDOCTRL_EN_DLY Mask */

#define MXC_F_GCR_NFCLDOCTRL_BP_EN_DLY_POS             14 /**< NFCLDOCTRL_BP_EN_DLY Position */
#define MXC_F_GCR_NFCLDOCTRL_BP_EN_DLY                 ((uint32_t)(0x1UL << MXC_F_GCR_NFCLDOCTRL_BP_EN_DLY_POS)) /**< NFCLDOCTRL_BP_EN_DLY Mask */

/**@} end of group GCR_NFCLDOCTRL_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_NFCLDODLY GCR_NFCLDODLY
 * @brief    NFC LDO Delay Register
 * @{
 */
#define MXC_F_GCR_NFCLDODLY_BP_CNT_POS                 0 /**< NFCLDODLY_BP_CNT Position */
#define MXC_F_GCR_NFCLDODLY_BP_CNT                     ((uint32_t)(0xFFUL << MXC_F_GCR_NFCLDODLY_BP_CNT_POS)) /**< NFCLDODLY_BP_CNT Mask */

#define MXC_F_GCR_NFCLDODLY_EN_CNT_POS                 8 /**< NFCLDODLY_EN_CNT Position */
#define MXC_F_GCR_NFCLDODLY_EN_CNT                     ((uint32_t)(0xFFUL << MXC_F_GCR_NFCLDODLY_EN_CNT_POS)) /**< NFCLDODLY_EN_CNT Mask */

/**@} end of group GCR_NFCLDODLY_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_GCR_REGS_H_
